// Задача 6 Напишите программу, которая на вход принимает трехзначное число, 
// а на выходе показывает последнюю цифру этого числа 

// int count = 1;
// int n = 4;
// while (count < n)
// {
Console.WriteLine("Введите трехзначное число: ");
int N = int.Parse(Console.ReadLine());
Console.WriteLite(N);
// string znach = stroka.Substr(3, 1);
// Console.WriteLite(znach);
// count = count + 1;
//}